###############################################################################
# Created by write_sdc
###############################################################################
current_design team_12_Wrapper
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name wb_clk_i -period 100.0000 [get_ports {wb_clk_i}]
set_clock_transition 0.1500 [get_clocks {wb_clk_i}]
set_clock_uncertainty 0.2500 wb_clk_i
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {ACK_I}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {DAT_I[0]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {DAT_I[10]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {DAT_I[11]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {DAT_I[12]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {DAT_I[13]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {DAT_I[14]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {DAT_I[15]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {DAT_I[16]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {DAT_I[17]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {DAT_I[18]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {DAT_I[19]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {DAT_I[1]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {DAT_I[20]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {DAT_I[21]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {DAT_I[22]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {DAT_I[23]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {DAT_I[24]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {DAT_I[25]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {DAT_I[26]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {DAT_I[27]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {DAT_I[28]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {DAT_I[29]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {DAT_I[2]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {DAT_I[30]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {DAT_I[31]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {DAT_I[3]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {DAT_I[4]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {DAT_I[5]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {DAT_I[6]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {DAT_I[7]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {DAT_I[8]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {DAT_I[9]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {gpio_in[0]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {gpio_in[10]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {gpio_in[11]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {gpio_in[12]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {gpio_in[13]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {gpio_in[14]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {gpio_in[15]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {gpio_in[16]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {gpio_in[17]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {gpio_in[18]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {gpio_in[19]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {gpio_in[1]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {gpio_in[20]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {gpio_in[21]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {gpio_in[22]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {gpio_in[23]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {gpio_in[24]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {gpio_in[25]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {gpio_in[26]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {gpio_in[27]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {gpio_in[28]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {gpio_in[29]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {gpio_in[2]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {gpio_in[30]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {gpio_in[31]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {gpio_in[32]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {gpio_in[33]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {gpio_in[34]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {gpio_in[35]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {gpio_in[36]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {gpio_in[37]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {gpio_in[3]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {gpio_in[4]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {gpio_in[5]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {gpio_in[6]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {gpio_in[7]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {gpio_in[8]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {gpio_in[9]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {la_data_in[0]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {la_data_in[10]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {la_data_in[11]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {la_data_in[12]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {la_data_in[13]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {la_data_in[14]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {la_data_in[15]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {la_data_in[16]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {la_data_in[17]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {la_data_in[18]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {la_data_in[19]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {la_data_in[1]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {la_data_in[20]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {la_data_in[21]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {la_data_in[22]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {la_data_in[23]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {la_data_in[24]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {la_data_in[25]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {la_data_in[26]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {la_data_in[27]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {la_data_in[28]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {la_data_in[29]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {la_data_in[2]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {la_data_in[30]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {la_data_in[31]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {la_data_in[3]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {la_data_in[4]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {la_data_in[5]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {la_data_in[6]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {la_data_in[7]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {la_data_in[8]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {la_data_in[9]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {la_oenb[0]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {la_oenb[10]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {la_oenb[11]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {la_oenb[12]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {la_oenb[13]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {la_oenb[14]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {la_oenb[15]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {la_oenb[16]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {la_oenb[17]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {la_oenb[18]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {la_oenb[19]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {la_oenb[1]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {la_oenb[20]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {la_oenb[21]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {la_oenb[22]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {la_oenb[23]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {la_oenb[24]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {la_oenb[25]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {la_oenb[26]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {la_oenb[27]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {la_oenb[28]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {la_oenb[29]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {la_oenb[2]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {la_oenb[30]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {la_oenb[31]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {la_oenb[3]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {la_oenb[4]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {la_oenb[5]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {la_oenb[6]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {la_oenb[7]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {la_oenb[8]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {la_oenb[9]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {wb_rst_i}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {wbs_adr_i[0]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {wbs_adr_i[10]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {wbs_adr_i[11]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {wbs_adr_i[12]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {wbs_adr_i[13]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {wbs_adr_i[14]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {wbs_adr_i[15]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {wbs_adr_i[16]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {wbs_adr_i[17]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {wbs_adr_i[18]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {wbs_adr_i[19]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {wbs_adr_i[1]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {wbs_adr_i[20]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {wbs_adr_i[21]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {wbs_adr_i[22]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {wbs_adr_i[23]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {wbs_adr_i[24]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {wbs_adr_i[25]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {wbs_adr_i[26]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {wbs_adr_i[27]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {wbs_adr_i[28]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {wbs_adr_i[29]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {wbs_adr_i[2]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {wbs_adr_i[30]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {wbs_adr_i[31]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {wbs_adr_i[3]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {wbs_adr_i[4]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {wbs_adr_i[5]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {wbs_adr_i[6]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {wbs_adr_i[7]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {wbs_adr_i[8]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {wbs_adr_i[9]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {wbs_cyc_i}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {wbs_dat_i[0]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {wbs_dat_i[10]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {wbs_dat_i[11]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {wbs_dat_i[12]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {wbs_dat_i[13]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {wbs_dat_i[14]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {wbs_dat_i[15]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {wbs_dat_i[16]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {wbs_dat_i[17]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {wbs_dat_i[18]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {wbs_dat_i[19]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {wbs_dat_i[1]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {wbs_dat_i[20]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {wbs_dat_i[21]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {wbs_dat_i[22]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {wbs_dat_i[23]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {wbs_dat_i[24]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {wbs_dat_i[25]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {wbs_dat_i[26]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {wbs_dat_i[27]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {wbs_dat_i[28]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {wbs_dat_i[29]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {wbs_dat_i[2]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {wbs_dat_i[30]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {wbs_dat_i[31]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {wbs_dat_i[3]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {wbs_dat_i[4]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {wbs_dat_i[5]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {wbs_dat_i[6]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {wbs_dat_i[7]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {wbs_dat_i[8]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {wbs_dat_i[9]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {wbs_sel_i[0]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {wbs_sel_i[1]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {wbs_sel_i[2]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {wbs_sel_i[3]}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {wbs_stb_i}]
set_input_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {wbs_we_i}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {ADR_O[0]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {ADR_O[10]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {ADR_O[11]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {ADR_O[12]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {ADR_O[13]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {ADR_O[14]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {ADR_O[15]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {ADR_O[16]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {ADR_O[17]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {ADR_O[18]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {ADR_O[19]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {ADR_O[1]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {ADR_O[20]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {ADR_O[21]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {ADR_O[22]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {ADR_O[23]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {ADR_O[24]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {ADR_O[25]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {ADR_O[26]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {ADR_O[27]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {ADR_O[28]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {ADR_O[29]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {ADR_O[2]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {ADR_O[30]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {ADR_O[31]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {ADR_O[3]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {ADR_O[4]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {ADR_O[5]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {ADR_O[6]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {ADR_O[7]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {ADR_O[8]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {ADR_O[9]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {CYC_O}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {DAT_O[0]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {DAT_O[10]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {DAT_O[11]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {DAT_O[12]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {DAT_O[13]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {DAT_O[14]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {DAT_O[15]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {DAT_O[16]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {DAT_O[17]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {DAT_O[18]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {DAT_O[19]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {DAT_O[1]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {DAT_O[20]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {DAT_O[21]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {DAT_O[22]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {DAT_O[23]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {DAT_O[24]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {DAT_O[25]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {DAT_O[26]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {DAT_O[27]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {DAT_O[28]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {DAT_O[29]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {DAT_O[2]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {DAT_O[30]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {DAT_O[31]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {DAT_O[3]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {DAT_O[4]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {DAT_O[5]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {DAT_O[6]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {DAT_O[7]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {DAT_O[8]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {DAT_O[9]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {SEL_O[0]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {SEL_O[1]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {SEL_O[2]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {SEL_O[3]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {STB_O}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {WE_O}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {gpio_oeb[0]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {gpio_oeb[10]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {gpio_oeb[11]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {gpio_oeb[12]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {gpio_oeb[13]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {gpio_oeb[14]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {gpio_oeb[15]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {gpio_oeb[16]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {gpio_oeb[17]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {gpio_oeb[18]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {gpio_oeb[19]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {gpio_oeb[1]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {gpio_oeb[20]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {gpio_oeb[21]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {gpio_oeb[22]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {gpio_oeb[23]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {gpio_oeb[24]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {gpio_oeb[25]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {gpio_oeb[26]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {gpio_oeb[27]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {gpio_oeb[28]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {gpio_oeb[29]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {gpio_oeb[2]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {gpio_oeb[30]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {gpio_oeb[31]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {gpio_oeb[32]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {gpio_oeb[33]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {gpio_oeb[34]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {gpio_oeb[35]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {gpio_oeb[36]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {gpio_oeb[37]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {gpio_oeb[3]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {gpio_oeb[4]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {gpio_oeb[5]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {gpio_oeb[6]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {gpio_oeb[7]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {gpio_oeb[8]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {gpio_oeb[9]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {gpio_out[0]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {gpio_out[10]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {gpio_out[11]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {gpio_out[12]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {gpio_out[13]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {gpio_out[14]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {gpio_out[15]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {gpio_out[16]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {gpio_out[17]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {gpio_out[18]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {gpio_out[19]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {gpio_out[1]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {gpio_out[20]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {gpio_out[21]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {gpio_out[22]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {gpio_out[23]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {gpio_out[24]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {gpio_out[25]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {gpio_out[26]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {gpio_out[27]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {gpio_out[28]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {gpio_out[29]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {gpio_out[2]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {gpio_out[30]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {gpio_out[31]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {gpio_out[32]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {gpio_out[33]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {gpio_out[34]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {gpio_out[35]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {gpio_out[36]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {gpio_out[37]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {gpio_out[3]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {gpio_out[4]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {gpio_out[5]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {gpio_out[6]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {gpio_out[7]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {gpio_out[8]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {gpio_out[9]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {irq[0]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {irq[1]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {irq[2]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {la_data_out[0]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {la_data_out[10]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {la_data_out[11]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {la_data_out[12]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {la_data_out[13]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {la_data_out[14]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {la_data_out[15]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {la_data_out[16]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {la_data_out[17]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {la_data_out[18]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {la_data_out[19]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {la_data_out[1]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {la_data_out[20]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {la_data_out[21]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {la_data_out[22]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {la_data_out[23]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {la_data_out[24]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {la_data_out[25]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {la_data_out[26]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {la_data_out[27]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {la_data_out[28]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {la_data_out[29]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {la_data_out[2]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {la_data_out[30]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {la_data_out[31]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {la_data_out[3]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {la_data_out[4]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {la_data_out[5]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {la_data_out[6]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {la_data_out[7]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {la_data_out[8]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {la_data_out[9]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {wbs_ack_o}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {wbs_dat_o[0]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {wbs_dat_o[10]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {wbs_dat_o[11]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {wbs_dat_o[12]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {wbs_dat_o[13]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {wbs_dat_o[14]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {wbs_dat_o[15]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {wbs_dat_o[16]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {wbs_dat_o[17]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {wbs_dat_o[18]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {wbs_dat_o[19]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {wbs_dat_o[1]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {wbs_dat_o[20]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {wbs_dat_o[21]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {wbs_dat_o[22]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {wbs_dat_o[23]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {wbs_dat_o[24]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {wbs_dat_o[25]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {wbs_dat_o[26]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {wbs_dat_o[27]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {wbs_dat_o[28]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {wbs_dat_o[29]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {wbs_dat_o[2]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {wbs_dat_o[30]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {wbs_dat_o[31]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {wbs_dat_o[3]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {wbs_dat_o[4]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {wbs_dat_o[5]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {wbs_dat_o[6]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {wbs_dat_o[7]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {wbs_dat_o[8]}]
set_output_delay 20.0000 -clock [get_clocks {wb_clk_i}] -add_delay [get_ports {wbs_dat_o[9]}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {CYC_O}]
set_load -pin_load 0.0334 [get_ports {STB_O}]
set_load -pin_load 0.0334 [get_ports {WE_O}]
set_load -pin_load 0.0334 [get_ports {wbs_ack_o}]
set_load -pin_load 0.0334 [get_ports {ADR_O[31]}]
set_load -pin_load 0.0334 [get_ports {ADR_O[30]}]
set_load -pin_load 0.0334 [get_ports {ADR_O[29]}]
set_load -pin_load 0.0334 [get_ports {ADR_O[28]}]
set_load -pin_load 0.0334 [get_ports {ADR_O[27]}]
set_load -pin_load 0.0334 [get_ports {ADR_O[26]}]
set_load -pin_load 0.0334 [get_ports {ADR_O[25]}]
set_load -pin_load 0.0334 [get_ports {ADR_O[24]}]
set_load -pin_load 0.0334 [get_ports {ADR_O[23]}]
set_load -pin_load 0.0334 [get_ports {ADR_O[22]}]
set_load -pin_load 0.0334 [get_ports {ADR_O[21]}]
set_load -pin_load 0.0334 [get_ports {ADR_O[20]}]
set_load -pin_load 0.0334 [get_ports {ADR_O[19]}]
set_load -pin_load 0.0334 [get_ports {ADR_O[18]}]
set_load -pin_load 0.0334 [get_ports {ADR_O[17]}]
set_load -pin_load 0.0334 [get_ports {ADR_O[16]}]
set_load -pin_load 0.0334 [get_ports {ADR_O[15]}]
set_load -pin_load 0.0334 [get_ports {ADR_O[14]}]
set_load -pin_load 0.0334 [get_ports {ADR_O[13]}]
set_load -pin_load 0.0334 [get_ports {ADR_O[12]}]
set_load -pin_load 0.0334 [get_ports {ADR_O[11]}]
set_load -pin_load 0.0334 [get_ports {ADR_O[10]}]
set_load -pin_load 0.0334 [get_ports {ADR_O[9]}]
set_load -pin_load 0.0334 [get_ports {ADR_O[8]}]
set_load -pin_load 0.0334 [get_ports {ADR_O[7]}]
set_load -pin_load 0.0334 [get_ports {ADR_O[6]}]
set_load -pin_load 0.0334 [get_ports {ADR_O[5]}]
set_load -pin_load 0.0334 [get_ports {ADR_O[4]}]
set_load -pin_load 0.0334 [get_ports {ADR_O[3]}]
set_load -pin_load 0.0334 [get_ports {ADR_O[2]}]
set_load -pin_load 0.0334 [get_ports {ADR_O[1]}]
set_load -pin_load 0.0334 [get_ports {ADR_O[0]}]
set_load -pin_load 0.0334 [get_ports {DAT_O[31]}]
set_load -pin_load 0.0334 [get_ports {DAT_O[30]}]
set_load -pin_load 0.0334 [get_ports {DAT_O[29]}]
set_load -pin_load 0.0334 [get_ports {DAT_O[28]}]
set_load -pin_load 0.0334 [get_ports {DAT_O[27]}]
set_load -pin_load 0.0334 [get_ports {DAT_O[26]}]
set_load -pin_load 0.0334 [get_ports {DAT_O[25]}]
set_load -pin_load 0.0334 [get_ports {DAT_O[24]}]
set_load -pin_load 0.0334 [get_ports {DAT_O[23]}]
set_load -pin_load 0.0334 [get_ports {DAT_O[22]}]
set_load -pin_load 0.0334 [get_ports {DAT_O[21]}]
set_load -pin_load 0.0334 [get_ports {DAT_O[20]}]
set_load -pin_load 0.0334 [get_ports {DAT_O[19]}]
set_load -pin_load 0.0334 [get_ports {DAT_O[18]}]
set_load -pin_load 0.0334 [get_ports {DAT_O[17]}]
set_load -pin_load 0.0334 [get_ports {DAT_O[16]}]
set_load -pin_load 0.0334 [get_ports {DAT_O[15]}]
set_load -pin_load 0.0334 [get_ports {DAT_O[14]}]
set_load -pin_load 0.0334 [get_ports {DAT_O[13]}]
set_load -pin_load 0.0334 [get_ports {DAT_O[12]}]
set_load -pin_load 0.0334 [get_ports {DAT_O[11]}]
set_load -pin_load 0.0334 [get_ports {DAT_O[10]}]
set_load -pin_load 0.0334 [get_ports {DAT_O[9]}]
set_load -pin_load 0.0334 [get_ports {DAT_O[8]}]
set_load -pin_load 0.0334 [get_ports {DAT_O[7]}]
set_load -pin_load 0.0334 [get_ports {DAT_O[6]}]
set_load -pin_load 0.0334 [get_ports {DAT_O[5]}]
set_load -pin_load 0.0334 [get_ports {DAT_O[4]}]
set_load -pin_load 0.0334 [get_ports {DAT_O[3]}]
set_load -pin_load 0.0334 [get_ports {DAT_O[2]}]
set_load -pin_load 0.0334 [get_ports {DAT_O[1]}]
set_load -pin_load 0.0334 [get_ports {DAT_O[0]}]
set_load -pin_load 0.0334 [get_ports {SEL_O[3]}]
set_load -pin_load 0.0334 [get_ports {SEL_O[2]}]
set_load -pin_load 0.0334 [get_ports {SEL_O[1]}]
set_load -pin_load 0.0334 [get_ports {SEL_O[0]}]
set_load -pin_load 0.0334 [get_ports {gpio_oeb[37]}]
set_load -pin_load 0.0334 [get_ports {gpio_oeb[36]}]
set_load -pin_load 0.0334 [get_ports {gpio_oeb[35]}]
set_load -pin_load 0.0334 [get_ports {gpio_oeb[34]}]
set_load -pin_load 0.0334 [get_ports {gpio_oeb[33]}]
set_load -pin_load 0.0334 [get_ports {gpio_oeb[32]}]
set_load -pin_load 0.0334 [get_ports {gpio_oeb[31]}]
set_load -pin_load 0.0334 [get_ports {gpio_oeb[30]}]
set_load -pin_load 0.0334 [get_ports {gpio_oeb[29]}]
set_load -pin_load 0.0334 [get_ports {gpio_oeb[28]}]
set_load -pin_load 0.0334 [get_ports {gpio_oeb[27]}]
set_load -pin_load 0.0334 [get_ports {gpio_oeb[26]}]
set_load -pin_load 0.0334 [get_ports {gpio_oeb[25]}]
set_load -pin_load 0.0334 [get_ports {gpio_oeb[24]}]
set_load -pin_load 0.0334 [get_ports {gpio_oeb[23]}]
set_load -pin_load 0.0334 [get_ports {gpio_oeb[22]}]
set_load -pin_load 0.0334 [get_ports {gpio_oeb[21]}]
set_load -pin_load 0.0334 [get_ports {gpio_oeb[20]}]
set_load -pin_load 0.0334 [get_ports {gpio_oeb[19]}]
set_load -pin_load 0.0334 [get_ports {gpio_oeb[18]}]
set_load -pin_load 0.0334 [get_ports {gpio_oeb[17]}]
set_load -pin_load 0.0334 [get_ports {gpio_oeb[16]}]
set_load -pin_load 0.0334 [get_ports {gpio_oeb[15]}]
set_load -pin_load 0.0334 [get_ports {gpio_oeb[14]}]
set_load -pin_load 0.0334 [get_ports {gpio_oeb[13]}]
set_load -pin_load 0.0334 [get_ports {gpio_oeb[12]}]
set_load -pin_load 0.0334 [get_ports {gpio_oeb[11]}]
set_load -pin_load 0.0334 [get_ports {gpio_oeb[10]}]
set_load -pin_load 0.0334 [get_ports {gpio_oeb[9]}]
set_load -pin_load 0.0334 [get_ports {gpio_oeb[8]}]
set_load -pin_load 0.0334 [get_ports {gpio_oeb[7]}]
set_load -pin_load 0.0334 [get_ports {gpio_oeb[6]}]
set_load -pin_load 0.0334 [get_ports {gpio_oeb[5]}]
set_load -pin_load 0.0334 [get_ports {gpio_oeb[4]}]
set_load -pin_load 0.0334 [get_ports {gpio_oeb[3]}]
set_load -pin_load 0.0334 [get_ports {gpio_oeb[2]}]
set_load -pin_load 0.0334 [get_ports {gpio_oeb[1]}]
set_load -pin_load 0.0334 [get_ports {gpio_oeb[0]}]
set_load -pin_load 0.0334 [get_ports {gpio_out[37]}]
set_load -pin_load 0.0334 [get_ports {gpio_out[36]}]
set_load -pin_load 0.0334 [get_ports {gpio_out[35]}]
set_load -pin_load 0.0334 [get_ports {gpio_out[34]}]
set_load -pin_load 0.0334 [get_ports {gpio_out[33]}]
set_load -pin_load 0.0334 [get_ports {gpio_out[32]}]
set_load -pin_load 0.0334 [get_ports {gpio_out[31]}]
set_load -pin_load 0.0334 [get_ports {gpio_out[30]}]
set_load -pin_load 0.0334 [get_ports {gpio_out[29]}]
set_load -pin_load 0.0334 [get_ports {gpio_out[28]}]
set_load -pin_load 0.0334 [get_ports {gpio_out[27]}]
set_load -pin_load 0.0334 [get_ports {gpio_out[26]}]
set_load -pin_load 0.0334 [get_ports {gpio_out[25]}]
set_load -pin_load 0.0334 [get_ports {gpio_out[24]}]
set_load -pin_load 0.0334 [get_ports {gpio_out[23]}]
set_load -pin_load 0.0334 [get_ports {gpio_out[22]}]
set_load -pin_load 0.0334 [get_ports {gpio_out[21]}]
set_load -pin_load 0.0334 [get_ports {gpio_out[20]}]
set_load -pin_load 0.0334 [get_ports {gpio_out[19]}]
set_load -pin_load 0.0334 [get_ports {gpio_out[18]}]
set_load -pin_load 0.0334 [get_ports {gpio_out[17]}]
set_load -pin_load 0.0334 [get_ports {gpio_out[16]}]
set_load -pin_load 0.0334 [get_ports {gpio_out[15]}]
set_load -pin_load 0.0334 [get_ports {gpio_out[14]}]
set_load -pin_load 0.0334 [get_ports {gpio_out[13]}]
set_load -pin_load 0.0334 [get_ports {gpio_out[12]}]
set_load -pin_load 0.0334 [get_ports {gpio_out[11]}]
set_load -pin_load 0.0334 [get_ports {gpio_out[10]}]
set_load -pin_load 0.0334 [get_ports {gpio_out[9]}]
set_load -pin_load 0.0334 [get_ports {gpio_out[8]}]
set_load -pin_load 0.0334 [get_ports {gpio_out[7]}]
set_load -pin_load 0.0334 [get_ports {gpio_out[6]}]
set_load -pin_load 0.0334 [get_ports {gpio_out[5]}]
set_load -pin_load 0.0334 [get_ports {gpio_out[4]}]
set_load -pin_load 0.0334 [get_ports {gpio_out[3]}]
set_load -pin_load 0.0334 [get_ports {gpio_out[2]}]
set_load -pin_load 0.0334 [get_ports {gpio_out[1]}]
set_load -pin_load 0.0334 [get_ports {gpio_out[0]}]
set_load -pin_load 0.0334 [get_ports {irq[2]}]
set_load -pin_load 0.0334 [get_ports {irq[1]}]
set_load -pin_load 0.0334 [get_ports {irq[0]}]
set_load -pin_load 0.0334 [get_ports {la_data_out[31]}]
set_load -pin_load 0.0334 [get_ports {la_data_out[30]}]
set_load -pin_load 0.0334 [get_ports {la_data_out[29]}]
set_load -pin_load 0.0334 [get_ports {la_data_out[28]}]
set_load -pin_load 0.0334 [get_ports {la_data_out[27]}]
set_load -pin_load 0.0334 [get_ports {la_data_out[26]}]
set_load -pin_load 0.0334 [get_ports {la_data_out[25]}]
set_load -pin_load 0.0334 [get_ports {la_data_out[24]}]
set_load -pin_load 0.0334 [get_ports {la_data_out[23]}]
set_load -pin_load 0.0334 [get_ports {la_data_out[22]}]
set_load -pin_load 0.0334 [get_ports {la_data_out[21]}]
set_load -pin_load 0.0334 [get_ports {la_data_out[20]}]
set_load -pin_load 0.0334 [get_ports {la_data_out[19]}]
set_load -pin_load 0.0334 [get_ports {la_data_out[18]}]
set_load -pin_load 0.0334 [get_ports {la_data_out[17]}]
set_load -pin_load 0.0334 [get_ports {la_data_out[16]}]
set_load -pin_load 0.0334 [get_ports {la_data_out[15]}]
set_load -pin_load 0.0334 [get_ports {la_data_out[14]}]
set_load -pin_load 0.0334 [get_ports {la_data_out[13]}]
set_load -pin_load 0.0334 [get_ports {la_data_out[12]}]
set_load -pin_load 0.0334 [get_ports {la_data_out[11]}]
set_load -pin_load 0.0334 [get_ports {la_data_out[10]}]
set_load -pin_load 0.0334 [get_ports {la_data_out[9]}]
set_load -pin_load 0.0334 [get_ports {la_data_out[8]}]
set_load -pin_load 0.0334 [get_ports {la_data_out[7]}]
set_load -pin_load 0.0334 [get_ports {la_data_out[6]}]
set_load -pin_load 0.0334 [get_ports {la_data_out[5]}]
set_load -pin_load 0.0334 [get_ports {la_data_out[4]}]
set_load -pin_load 0.0334 [get_ports {la_data_out[3]}]
set_load -pin_load 0.0334 [get_ports {la_data_out[2]}]
set_load -pin_load 0.0334 [get_ports {la_data_out[1]}]
set_load -pin_load 0.0334 [get_ports {la_data_out[0]}]
set_load -pin_load 0.0334 [get_ports {wbs_dat_o[31]}]
set_load -pin_load 0.0334 [get_ports {wbs_dat_o[30]}]
set_load -pin_load 0.0334 [get_ports {wbs_dat_o[29]}]
set_load -pin_load 0.0334 [get_ports {wbs_dat_o[28]}]
set_load -pin_load 0.0334 [get_ports {wbs_dat_o[27]}]
set_load -pin_load 0.0334 [get_ports {wbs_dat_o[26]}]
set_load -pin_load 0.0334 [get_ports {wbs_dat_o[25]}]
set_load -pin_load 0.0334 [get_ports {wbs_dat_o[24]}]
set_load -pin_load 0.0334 [get_ports {wbs_dat_o[23]}]
set_load -pin_load 0.0334 [get_ports {wbs_dat_o[22]}]
set_load -pin_load 0.0334 [get_ports {wbs_dat_o[21]}]
set_load -pin_load 0.0334 [get_ports {wbs_dat_o[20]}]
set_load -pin_load 0.0334 [get_ports {wbs_dat_o[19]}]
set_load -pin_load 0.0334 [get_ports {wbs_dat_o[18]}]
set_load -pin_load 0.0334 [get_ports {wbs_dat_o[17]}]
set_load -pin_load 0.0334 [get_ports {wbs_dat_o[16]}]
set_load -pin_load 0.0334 [get_ports {wbs_dat_o[15]}]
set_load -pin_load 0.0334 [get_ports {wbs_dat_o[14]}]
set_load -pin_load 0.0334 [get_ports {wbs_dat_o[13]}]
set_load -pin_load 0.0334 [get_ports {wbs_dat_o[12]}]
set_load -pin_load 0.0334 [get_ports {wbs_dat_o[11]}]
set_load -pin_load 0.0334 [get_ports {wbs_dat_o[10]}]
set_load -pin_load 0.0334 [get_ports {wbs_dat_o[9]}]
set_load -pin_load 0.0334 [get_ports {wbs_dat_o[8]}]
set_load -pin_load 0.0334 [get_ports {wbs_dat_o[7]}]
set_load -pin_load 0.0334 [get_ports {wbs_dat_o[6]}]
set_load -pin_load 0.0334 [get_ports {wbs_dat_o[5]}]
set_load -pin_load 0.0334 [get_ports {wbs_dat_o[4]}]
set_load -pin_load 0.0334 [get_ports {wbs_dat_o[3]}]
set_load -pin_load 0.0334 [get_ports {wbs_dat_o[2]}]
set_load -pin_load 0.0334 [get_ports {wbs_dat_o[1]}]
set_load -pin_load 0.0334 [get_ports {wbs_dat_o[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ACK_I}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wb_clk_i}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wb_rst_i}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wbs_cyc_i}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wbs_stb_i}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wbs_we_i}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {DAT_I[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {DAT_I[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {DAT_I[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {DAT_I[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {DAT_I[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {DAT_I[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {DAT_I[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {DAT_I[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {DAT_I[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {DAT_I[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {DAT_I[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {DAT_I[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {DAT_I[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {DAT_I[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {DAT_I[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {DAT_I[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {DAT_I[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {DAT_I[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {DAT_I[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {DAT_I[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {DAT_I[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {DAT_I[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {DAT_I[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {DAT_I[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {DAT_I[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {DAT_I[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {DAT_I[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {DAT_I[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {DAT_I[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {DAT_I[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {DAT_I[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {DAT_I[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gpio_in[37]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gpio_in[36]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gpio_in[35]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gpio_in[34]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gpio_in[33]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gpio_in[32]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gpio_in[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gpio_in[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gpio_in[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gpio_in[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gpio_in[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gpio_in[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gpio_in[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gpio_in[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gpio_in[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gpio_in[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gpio_in[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gpio_in[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gpio_in[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gpio_in[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gpio_in[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gpio_in[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gpio_in[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gpio_in[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gpio_in[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gpio_in[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gpio_in[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gpio_in[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gpio_in[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gpio_in[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gpio_in[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gpio_in[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gpio_in[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gpio_in[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gpio_in[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gpio_in[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gpio_in[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gpio_in[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_data_in[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_data_in[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_data_in[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_data_in[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_data_in[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_data_in[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_data_in[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_data_in[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_data_in[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_data_in[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_data_in[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_data_in[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_data_in[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_data_in[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_data_in[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_data_in[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_data_in[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_data_in[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_data_in[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_data_in[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_data_in[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_data_in[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_data_in[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_data_in[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_data_in[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_data_in[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_data_in[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_data_in[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_data_in[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_data_in[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_data_in[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_data_in[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_oenb[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_oenb[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_oenb[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_oenb[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_oenb[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_oenb[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_oenb[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_oenb[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_oenb[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_oenb[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_oenb[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_oenb[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_oenb[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_oenb[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_oenb[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_oenb[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_oenb[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_oenb[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_oenb[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_oenb[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_oenb[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_oenb[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_oenb[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_oenb[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_oenb[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_oenb[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_oenb[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_oenb[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_oenb[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_oenb[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_oenb[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_oenb[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wbs_adr_i[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wbs_adr_i[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wbs_adr_i[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wbs_adr_i[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wbs_adr_i[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wbs_adr_i[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wbs_adr_i[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wbs_adr_i[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wbs_adr_i[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wbs_adr_i[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wbs_adr_i[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wbs_adr_i[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wbs_adr_i[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wbs_adr_i[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wbs_adr_i[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wbs_adr_i[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wbs_adr_i[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wbs_adr_i[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wbs_adr_i[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wbs_adr_i[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wbs_adr_i[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wbs_adr_i[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wbs_adr_i[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wbs_adr_i[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wbs_adr_i[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wbs_adr_i[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wbs_adr_i[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wbs_adr_i[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wbs_adr_i[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wbs_adr_i[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wbs_adr_i[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wbs_adr_i[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wbs_dat_i[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wbs_dat_i[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wbs_dat_i[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wbs_dat_i[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wbs_dat_i[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wbs_dat_i[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wbs_dat_i[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wbs_dat_i[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wbs_dat_i[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wbs_dat_i[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wbs_dat_i[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wbs_dat_i[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wbs_dat_i[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wbs_dat_i[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wbs_dat_i[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wbs_dat_i[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wbs_dat_i[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wbs_dat_i[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wbs_dat_i[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wbs_dat_i[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wbs_dat_i[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wbs_dat_i[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wbs_dat_i[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wbs_dat_i[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wbs_dat_i[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wbs_dat_i[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wbs_dat_i[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wbs_dat_i[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wbs_dat_i[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wbs_dat_i[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wbs_dat_i[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wbs_dat_i[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wbs_sel_i[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wbs_sel_i[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wbs_sel_i[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wbs_sel_i[0]}]
###############################################################################
# Design Rules
###############################################################################
set_max_transition 0.7500 [current_design]
set_max_capacitance 0.2000 [current_design]
set_max_fanout 10.0000 [current_design]
